cat digits0-29.txt | cut -d ' ' -f4-,2 |tr '.' ' '| awk '{if($3=="один") { print $1","$2,$3; print  $1","$2,"первого"; print  $1","$2,"первый"; } \
if ($3=="два")  { print $1","$2,$3; print  $1","$2,"второго"; print  $1","$2,"второй"; }
if ($3=="три")  { print $1","$2,$3; print  $1","$2,"третьего"; print  $1","$2,"третий";  }
if ($3=="четыре")  { print $1","$2,$3; print  $1","$2,"четвертого"; print  $1","$2,"четвертый"; }
if ($3=="пять")  { print $1","$2,$3; print  $1","$2,"пятого"; print  $1","$2,"пятый";  }
if ($3=="шесть")  { print $1","$2,$3; print  $1","$2,"шестого";  print  $1","$2,"шестой"; }
if ($3=="семь")  { print $1","$2,$3; print  $1","$2,"седьмого"; print  $1","$2,"седьмой"; }
if ($3=="восемь")  { print $1","$2,$3; print  $1","$2,"восьмого"; print  $1","$2,"восьмой"; }
if ($3=="девять")  { print $1","$2,$3; print  $1","$2,"девятого"; print  $1","$2,"девятый"; }
}'

